//数组指针 -- 指针

//int main()
//{
//    //int *p=NULL;  //p 是整型指针 - 指向整型的指针 - 可以存放整型的地址
//    //char *pc=NULL;//pc是字符指针 - 指向字符的指针 - 可以存放字符的地址
//                    //    数组指针 - 指向数组的指针 - 存放数组的地址
//    //int arr[10]={0};
//    //arr - 首元素地址
//    //arr[0] - 首元素的地址
//    //&arr - 数组的地址
//
//    int arr[10] = { 1,2,3,4,5,6,7,8,9,10 };
//    int(*p)[10] = &arr;//取出数组的地址
//    //上面的p就是数组指针
//
//    return 0;
//}
//
//int main()
//{
//    char* arr[5];
//    char* (*pa)[5] = &arr;          //char* : pa指向的数组的元素类型是char*
//                 // pa   : 指针变量的名字
//                 // *    : 说明pa是指针
//                 // [5]  : pa指向的数组是5个元素的
//
//    int arr2[10] = { 0 };
//    int(*pa2)[10] = &arr2;
//
//    return 0;
//}
//
////数组指针的用法
//
//int main()		    //数组指针不是这么用的（一般用于二维数组）
//{
//    int arr[10] = { 1,2,3,4,5,6,7,8,9,10 };			int arr[10] = { 1,2,3,4,5,6,7,8,9,10 };
//    int(*pa)[10] = &arr;                            int* p = arr;
//    int i = 0;						                int i = 0;
//    for (i = 0; i < 10; i++)					    for (i = 0; i < 10; i++)
//    {
//        {
//            printf("%d ", (*pa)[i]);				   printf("%d ", *(p + i));
//            //printf("%d ",*(*pa+i));//*pa==arr;	   printf("%d ", *(arr+i));
//        }							                   printf("%d ", arr[i]);
//                                                       //arr[i]==*(arr+i)==*(p+i)==p[i]
//    }
//    return 0;
//
//}
//
//
////参数是指针的形式
//void print2(int(*p)[5], int x, int y)
//{
//    int i = 0;
//    for (i = 0; i < x; i++)
//    {
//        int j = 0;
//        for (j = 0; j < y; j++)
//        {
//            printf("%d ", p[i][j]);
//            printf("%d ", *(p[i] + j));
//            printf("%d ", *(*(p + i) + j));
//            printf("%d ", (*(p + i))[j]);
//        }
//        printf("\n");
//    }
//}
//void print1(int arr[3][5], int x, int y)
//{
//    int i = 0;
//    int j = 0;
//    for (i = 0; i < x; i++)
//    {
//        for (j = 0; j < y; j++)
//        {
//            printf("%d ", arr[i][j]);
//        }
//        printf("\n");
//    }
//}
//
//int mian()
//{
//        int arr[3][5] = { {1,2,3,4,5},{2,3,4,5,6},{3,4,5,6,7} };		//1 2 3 4 5      int[5] 
//                                                                        //2 3 4 5 6 
//        print1(arr, 3, 5); //arr - 数组名 - 数组名就是首元素地址        //3 4 5 6 7
//         //把arr想象成一维数组
//        print2(arr, 3, 5);
//
//    return 0;
//}
//
////———————————————————————————————————————————
////**************************************************************************************
//int arr[5]           //arr  :是一个5个元素的整型数组
//int* parr1[10]       //parr1:是一个数组，数组有10个元素，每个元素的类型是int*，
////                   parr1是指针数组
//int(*parr2)[10]      //parr2:是一个指针，该指针指向了一个数组，数组有10个元素，
//                     //每个元素的类型是int，parr2是数组指针
//int(*parr3[10])[5]   //parr3:是一个数组，该数组有10个元素，每个元素是一个数组指针，
//                     //每个元素是int，parr3是数组指针数组
////**************************************************************************************
////———————————————————————————————————————————

